In [ ]:
!pip openai, requests, pandas, tiktoken

In [1]:
#!/usr/bin/env python
import json, openai,requests
import warnings
import os
warnings.filterwarnings('ignore')
import datetime
from time import sleep

In [2]:
openai_org = "org-num"
openai_key = "sk-num"

In [2]:
import tiktoken
import pandas as pd
def num_tokens_from_string(string: str, 
                           encoding_name: str = 'text-davinci-003') -> int:
    """Returns the number of tokens in a text string."""
    encoding = tiktoken.encoding_for_model(encoding_name)
    num_tokens = len(encoding.encode(string))
    return num_tokens

In [3]:
num_tokens_from_string("This is my super prompt from Insight Builder")

8

In [4]:
get_role = input("What role you want me to play: ")

What role you want me to play: Master Python Pandas and Excel Analyst

In [5]:
def cgpt_reply(org,key,
                    role_player,
                    request_content,
                   file_name='excel_master.txt'):
    openai.organization = org
    openai.api_key= key
    response = openai.ChatCompletion.create(
        model="gpt-3.5-turbo",
        temperature = 0,
        messages=[
            {"role": "system", 
             "content": f"You are a {role_player}"},
            {"role": "assistant", 
             "content": f"I have assumed the role of {role_player}"},
            {"role": "user", 
             "content": f"Here is the dataset {request_content}."}
            ]
        )
    with open(file_name,'a+') as sumry:
        sumry.write(f'Completion for \n {request_content}')
        sumry.write('******Completion starts****** \n')
        sumry.write(str(response['choices'][0]['message']['content']))
        sumry.write('*****Completion ends****** \n')
    return response['choices'][0]['message']['content']

In [7]:
load_XL_Python = """I have a data_in_excel.xlsx file having data
inside Database worksheet. Tell me how to 
1) Import excel file data into Python pandas library
2) List top 5 Pandas commands I can use to Analyse the data
3) Import excel file data into Python openpyxl library
4) List the commands to create charts using the data in openpyxl"""

In [9]:
cgpt_reply1 = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=load_XL_Python)

In [11]:
print(cgpt_reply1)

Sure, I can help you with that.

1) Import excel file data into Python pandas library:

To import excel file data into Python pandas library, you can use the `read_excel()` function from pandas. Here's an example:

```python
import pandas as pd

# read excel file
df = pd.read_excel('data_in_excel.xlsx', sheet_name='Database')

# print first 5 rows of the dataframe
print(df.head())
```

2) List top 5 Pandas commands I can use to Analyse the data:

Here are the top 5 Pandas commands you can use to analyze the data:

- `df.head()`: This command returns the first n rows of the dataframe. By default, n is 5.
- `df.describe()`: This command returns the summary statistics of the numerical columns in the dataframe.
- `df.info()`: This command returns the information about the dataframe, such as the number of rows, columns, data types, and memory usage.
- `df.groupby()`: This command groups the dataframe by one or more columns and applies a function to each group.
- `df.pivot_table()`: This command creates a pivot table from the dataframe.

3) Import excel file data into Python openpyxl library:

To import excel file data into Python openpyxl library, you can use the `load_workbook()` function from openpyxl. Here's an example:

```python
from openpyxl import load_workbook

# load excel file
wb = load_workbook('data_in_excel.xlsx')

# select worksheet
ws = wb['Database']

# print cell value
print(ws['A1'].value)
```

4) List the commands to create charts using the data in openpyxl:

Here are the commands to create charts using the data in openpyxl:

- `openpyxl.chart`: This module contains classes for creating charts in openpyxl.
- `openpyxl.chart.Reference()`: This class creates a reference to a range of cells in the worksheet.
- `openpyxl.chart.Series()`: This class creates a series for the chart.
- `openpyxl.chart.Chart()`: This class creates a chart object.
- `openpyxl.chart.LineChart()`: This class creates a line chart object.
- `openpyxl.chart.BarChart()`: This class creates a bar chart object.
- `openpyxl.chart.PieChart()`: This class creates a pie chart object.
- `openpyxl.chart.Legend()`: This class creates a legend for the chart.
- `openpyxl.chart.Title()`: This class creates a title for the chart.

Here's an example of how to create a line chart using openpyxl:

```python
from openpyxl import load_workbook
from openpyxl.chart import Reference, Series, LineChart

# load excel file
wb = load_workbook('data_in_excel.xlsx')

# select worksheet
ws = wb['Database']

# create chart object
chart = LineChart()

# create data series
xvalues = Reference(ws, min_col=1, min_row=2, max_row=11)
yvalues = Reference(ws, min_col=2, min_row=2, max_row=11)
series = Series(values=yvalues, xvalues=xvalues, title='Data')

# add data series to chart
chart.append(series)

# add chart to worksheet
ws.add_chart(chart, 'D1')

# save excel file
wb.save('data_in_excel.xlsx')
```

This code creates a line chart from the data in columns A and B of the worksheet 'Database' and adds it to cell D1 of the same worksheet.

In [15]:
import pandas as pd

# read excel file
database = pd.read_excel('data_in_excel.xlsx', sheet_name='Database')

In [14]:
# print first 5 rows of the dataframe
database.head()

,Id,Date,Customers,Gender,Sales Reps,Drinks/Products,Categories,Cost,Sals Price,Qty
0,1,2019-01-01,Bernard Weatherly,M,timika poe,Heineken Bottle,Alcoholic Wine,38250,42500,3
1,2,2019-01-02,Cordia Knopp,F,zona otis,Origin Bottle,Alcoholic Wine,2700,3000,5
2,3,2019-01-03,Burton Jin,M,quentin kunz,Smirnoff Bottle,Alcoholic Wine,23850,26500,1
3,4,2019-01-04,Lauren Guzzi,M,quentin kunz,Frontera Rose 75Cl,Alcoholic Wine,24750,27500,5
4,5,2019-01-05,Carter Hunt,M,quentin kunz,Frontera Sauv Blanc 75Cl,Alcoholic Wine,44550,49500,7

In [18]:
database.describe()

               Id          Cost    Sals Price         Qty
count  683.000000    683.000000    683.000000  683.000000
mean   342.000000  17349.180088  19282.723280   10.859444
std    197.309402  21415.587536  23791.674846   11.477283
min      1.000000   1800.000000   2000.000000    1.000000
25%    171.500000   3870.000000   4300.000000    4.000000
50%    342.000000   8280.000000   9200.000000    8.000000
75%    512.500000  24300.000000  27000.000000   10.000000
max    683.000000  88200.000000  98000.000000   56.000000

In [19]:
database.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 683 entries, 0 to 682
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Id               683 non-null    int64
 1   Date             683 non-null    datetime64[ns]
 2   Customers        683 non-null    object
 3   Gender           683 non-null    object
 4   Sales Reps       683 non-null    object
 5   Drinks/Products  683 non-null    object
 6   Categories       683 non-null    object
 7   Cost             683 non-null    int64
 8   Sals Price       683 non-null    int64
 9   Qty              683 non-null    int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 53.5+ KB

In [29]:
help_piv_grp = """The data is having Date, Customers, Gender, 
Sales Reps, Drinks/Products and Categories columns that are not 
numbers. Provide me 3 examples of df.groupby() and df.pivot_table()
methods using these column"""

In [21]:
help_reply = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=help_piv_grp)

In [22]:
print(help_reply)

Sure, here are three examples of `df.groupby()` and `df.pivot_table()` methods using the given columns:

Example 1: Using `df.groupby()` to group the data by Gender and calculate the total sales made by each gender.

```python
import pandas as pd

# Read the dataset
df = pd.read_csv('sales_data.csv')

# Group the data by Gender and calculate the total sales made by each gender
gender_sales = df.groupby('Gender')['Sales'].sum()

print(gender_sales)
```

Output:
```
Gender
Female    12000
Male      15000
Name: Sales, dtype: int64
```

Example 2: Using `df.pivot_table()` to create a pivot table that shows the average sales made by each Sales Rep for each Category.

```python
import pandas as pd

# Read the dataset
df = pd.read_csv('sales_data.csv')

# Create a pivot table that shows the average sales made by each Sales Rep for each Category
sales_pivot = pd.pivot_table(df, values='Sales', index='Sales Reps', columns='Categories', aggfunc='mean')

print(sales_pivot)
```

Output:
```
Categories   Coffee  Juice  Smoothie
Sales Reps
John          100.0  150.0     200.0
Mary          150.0  200.0     250.0
```

Example 3: Using `df.groupby()` to group the data by Date and calculate the total number of Customers who made a purchase on each date.

```python
import pandas as pd

# Read the dataset
df = pd.read_csv('sales_data.csv')

# Convert the Date column to datetime format
df['Date'] = pd.to_datetime(df['Date'])

# Group the data by Date and calculate the total number of Customers who made a purchase on each date
customer_count = df.groupby('Date')['Customers'].count()

print(customer_count)
```

Output:
```
Date
2021-01-01    3
2021-01-02    2
2021-01-03    2
Name: Customers, dtype: int64
```

In [23]:
#using group-by
gender_sales = database.groupby('Gender')['Sals Price'].sum()
gender_sales

Gender
F    7176550
M    5993550
Name: Sals Price, dtype: int64

In [24]:
#using pivot_table
sales_pivot = pd.pivot_table(database, 
                             values='Sals Price', 
                             index='Sales Reps', 
                             columns='Categories', 
                             aggfunc='mean')
sales_pivot

Categories     Alcoholic Wine          Bear  Non Alcoholic
Sales Reps
hyman irish      22275.714286  20275.925926    12040.322581
quentin kunz     21971.917808  23671.052632    15646.774194
timika poe       18600.862069  22391.836735    24144.444444
zona otis        22482.031250  19819.672131    14950.505051

In [ ]:
#Not required, as already in datetime format
database['Date'] = pd.to_datetime(database['Date'])

In [26]:
# Group the data by Date and calculate the total number of Customers who made a purchase on each date
customer_count = database.groupby('Date')['Customers'].count()
customer_count

Date
2019-01-01    1
2019-01-02    1
2019-01-03    1
2019-01-04    1
2019-01-05    1
             ..
2020-11-09    1
2020-11-10    1
2020-11-11    1
2020-11-12    1
2020-11-13    1
Name: Customers, Length: 683, dtype: int64

In [35]:
help_grp = """The data is having Sales Reps, Drinks/Products and 
Categories columns that are categories. There are Sals Price, Cost
and Qty columns that are numbers. Tell me how I can get Profit for 
each sale in this dataset. Then Provide me 5 examples of 
df.groupby() methods using these column. Include the Profit column
also."""

In [36]:
help_grp_reply = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=help_grp)

In [37]:
print(help_grp_reply)

To get the profit for each sale in the dataset, we can create a new column called "Profit" which is the difference between the Sales Price and Cost columns. We can do this using the following code:

```python
import pandas as pd

# read in the dataset
df = pd.read_csv('sales_data.csv')

# create a new column for profit
df['Profit'] = df['Sales Price'] - df['Cost']

# view the updated dataframe
print(df.head())
```

This will add a new column called "Profit" to the dataframe, which is the difference between the Sales Price and Cost columns.

Now, here are 5 examples of `df.groupby()` methods using the Profit column:

1. Group by Sales Rep and calculate the total profit for each rep:

```python
rep_profit = df.groupby('Sales Rep')['Profit'].sum()
print(rep_profit)
```

2. Group by Category and calculate the average profit for each category:

```python
cat_profit = df.groupby('Category')['Profit'].mean()
print(cat_profit)
```

3. Group by Product and calculate the maximum profit for each product:

```python
prod_profit = df.groupby('Product')['Profit'].max()
print(prod_profit)
```

4. Group by Sales Rep and Category and calculate the total profit for each combination:

```python
rep_cat_profit = df.groupby(['Sales Rep', 'Category'])['Profit'].sum()
print(rep_cat_profit)
```

5. Group by Sales Rep and Product and calculate the average profit for each combination:

```python
rep_prod_profit = df.groupby(['Sales Rep', 'Product'])['Profit'].mean()
print(rep_prod_profit)
```

In each of these examples, we are grouping the dataframe by one or more columns and then performing an operation on the Profit column. The resulting output shows the calculated value for each group.

In [38]:
database['Profit'] = database['Sals Price'] - database['Cost']

In [40]:
database.head(2)

,Id,Date,Customers,Gender,Sales Reps,Drinks/Products,Categories,Cost,Sals Price,Qty,Profit
0,1,2019-01-01,Bernard Weatherly,M,timika poe,Heineken Bottle,Alcoholic Wine,38250,42500,3,4250
1,2,2019-01-02,Cordia Knopp,F,zona otis,Origin Bottle,Alcoholic Wine,2700,3000,5,300

In [39]:
sp_cost_profit = database.groupby('Sales Reps')['Sals Price','Cost',
                                               'Profit'].sum()

In [41]:
sp_cost_profit.head(2)

              Sals Price     Cost  Profit
Sales Reps
hyman irish      2073600  1864140  209460
quentin kunz     3923300  3530970  392330

In [43]:
cat_profit = database.groupby('Category')['Profit'].mean()

KeyError: 'Category'

In [48]:
cat_profit = database.groupby('Categories')['Profit'].mean()

In [50]:
cat_profit

Categories
 Alcoholic Wine    2131.000000
Bear               2166.443299
Non Alcoholic      1583.745174
Name: Profit, dtype: float64

In [45]:
prod_profit = database.groupby('Drinks/Products')['Profit'].max()

In [52]:
prod_profit.head(3)

Drinks/Products
5 Alive 1Ltr        9800
Amstel Malta Can    4250
CHAMDOR 75CL        5900
Name: Profit, dtype: int64

In [47]:
rep_cat_profit = database.groupby(['Sales Reps', 'Categories'])['Profit'].sum()

In [53]:
rep_cat_profit

Sales Reps    Categories
hyman irish    Alcoholic Wine     77965
              Bear                54745
              Non Alcoholic       76750
quentin kunz   Alcoholic Wine    160395
              Bear               134925
              Non Alcoholic       97010
timika poe     Alcoholic Wine    107885
              Bear               109720
              Non Alcoholic       86920
zona otis      Alcoholic Wine    143885
              Bear               120900
              Non Alcoholic      149510
Name: Profit, dtype: int64

In [32]:
help_pivot = """The data is having Sales Reps, Drinks/Products and 
Categories columns that are categories. There are Sals Price, Cost
and Profit columns that are numbers. Provide me 5 examples of 
df.pivot_table() methods using these column"""

In [33]:
help_pivot_reply = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=help_pivot)

In [54]:
print(help_pivot_reply)

Sure, here are 5 examples of `df.pivot_table()` methods using the given columns:

1. Pivot table to calculate the average sales price, cost, and profit for each sales rep:

```python
df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Sales Rep', aggfunc='mean')
```

2. Pivot table to calculate the total sales price, cost, and profit for each product:

```python
df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Drinks/Products', aggfunc='sum')
```

3. Pivot table to calculate the maximum sales price, cost, and profit for each category:

```python
df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Categories', aggfunc='max')
```

4. Pivot table to calculate the minimum sales price, cost, and profit for each sales rep and category:

```python
df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index=['Sales Rep', 'Categories'], aggfunc='min')
```

5. Pivot table to calculate the median sales price, cost, and profit for each sales rep and product:

```python
df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index=['Sales Rep', 'Drinks/Products'], aggfunc='median')
```

In [64]:
reply_list = help_pivot_reply.split('python')
for reply in reply_list:
    print(reply.strip().replace('```',''))

Sure, here are 5 examples of `df.pivot_table()` methods using the given columns:

1. Pivot table to calculate the average sales price, cost, and profit for each sales rep:


df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Sales Rep', aggfunc='mean')


2. Pivot table to calculate the total sales price, cost, and profit for each product:


df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Drinks/Products', aggfunc='sum')


3. Pivot table to calculate the maximum sales price, cost, and profit for each category:


df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index='Categories', aggfunc='max')


4. Pivot table to calculate the minimum sales price, cost, and profit for each sales rep and category:


df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index=['Sales Rep', 'Categories'], aggfunc='min')


5. Pivot table to calculate the median sales price, cost, and profit for each sales rep and product:


df.pivot_table(values=['Sales Price', 'Cost', 'Profit'], index=['Sales Rep', 'Drinks/Products'], aggfunc='median')

In [56]:
pivot1 = database.pivot_table(values=['Sals Price', 'Cost', 'Profit'], index='Sales Reps', aggfunc='mean')

In [57]:
pivot1

                      Cost       Profit    Sals Price
Sales Reps
hyman irish   15033.387097  1689.193548  16722.580645
quentin kunz  18390.468750  2043.385417  20433.854167
timika poe    19165.909091  2129.545455  21295.454545
zona otis     16578.816964  1849.531250  18428.348214

In [58]:
pivot2 = database.pivot_table(values=['Sals Price', 'Cost', 'Profit'], index='Drinks/Products', aggfunc='sum')

In [60]:
pivot2.head(2)

                    Cost  Profit  Sals Price
Drinks/Products
5 Alive 1Ltr      332190   36910      369100
Amstel Malta Can  296880   34820      331700

In [65]:
help_automate = """I have 10 excel sheets with data in Database worksheet.
Data is having Sales Reps, Drinks/Products and Categories columns that are 
categories. There are Sals Price, Cost and Profit columns that are numbers. 
Provide me a python script that loads the data from excel in pandas, 
analysis it using 

1) 5 pandas groupby method
2) 5 pivot_table method

and then writes the result to excel file called 'results_excel.xlsx'"""

In [66]:
help_automate = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=help_automate)

In [67]:
print(help_automate)

Sure, here's a Python script that should do what you're asking for:

```python
import pandas as pd

# Load the data from the 10 Excel sheets into a single DataFrame
df = pd.concat(pd.read_excel('data.xlsx', sheet_name=None), ignore_index=True)

# Perform 5 groupby analyses
groupby1 = df.groupby('Sales Rep')['Sales Price'].sum()
groupby2 = df.groupby('Drinks/Products')['Sales Price'].sum()
groupby3 = df.groupby('Categories')['Sales Price'].sum()
groupby4 = df.groupby(['Sales Rep', 'Categories'])['Sales Price'].sum()
groupby5 = df.groupby(['Drinks/Products', 'Categories'])['Sales Price'].sum()

# Perform 5 pivot table analyses
pivot1 = pd.pivot_table(df, values='Sales Price', index='Sales Rep', columns='Categories', aggfunc='sum')
pivot2 = pd.pivot_table(df, values='Sales Price', index='Drinks/Products', columns='Categories', aggfunc='sum')
pivot3 = pd.pivot_table(df, values='Sales Price', index='Sales Rep', columns='Drinks/Products', aggfunc='sum')
pivot4 = pd.pivot_table(df, values='Sales Price', index='Categories', columns='Sales Rep', aggfunc='sum')
pivot5 = pd.pivot_table(df, values='Sales Price', index='Categories', columns='Drinks/Products', aggfunc='sum')

# Write the results to an Excel file
with pd.ExcelWriter('results_excel.xlsx') as writer:
    groupby1.to_excel(writer, sheet_name='Groupby 1')
    groupby2.to_excel(writer, sheet_name='Groupby 2')
    groupby3.to_excel(writer, sheet_name='Groupby 3')
    groupby4.to_excel(writer, sheet_name='Groupby 4')
    groupby5.to_excel(writer, sheet_name='Groupby 5')
    pivot1.to_excel(writer, sheet_name='Pivot 1')
    pivot2.to_excel(writer, sheet_name='Pivot 2')
    pivot3.to_excel(writer, sheet_name='Pivot 3')
    pivot4.to_excel(writer, sheet_name='Pivot 4')
    pivot5.to_excel(writer, sheet_name='Pivot 5')
```

This script assumes that your Excel file is named 'data.xlsx' and that the 10 sheets containing the data are all named 'Database'. If your file and sheet names are different, you'll need to adjust the script accordingly.

In [ ]:
rectify_error = """It seems the df = pd.concat(pd.read_excel('data.xlsx', sheet_name=None), ignore_index=True)
command is not working. The following error thrown. Could you help me.'"""
error_reply = cgpt_reply(org=openai_org,key=openai_key,
                       role_player=get_role,
                        request_content=rectify_error)